Revit 2024 API
ConnectorElement.CreatePipeConnector Method
Overload List
Name | Description
CreatePipeConnector(Document, PipeSystemType, Reference)
 Create a new pipe ConnectorElement.
CreatePipeConnector(Document, PipeSystemType, Reference, Edge)
 Create a new pipe ConnectorElement with a face and an edge.
See Also
ConnectorElement Class
ConnectorElement Members
Autodesk.Revit.DB Namespace